RIET/src/Documents/СписаниеСуммПоДекларациям/СписаниеСуммПоДекларациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСуммПоДекларациям</name>
  <registerRecords>AccumulationRegister.ИмпортМенеджмент</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Таможня</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <comment>Номер ГТД       (Declaration №)¶</comment>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетГААП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПошлин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодВЛоусоне</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийНомерГТД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСуммаТаможенныхПлатежей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПошлин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>10</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.Декларации</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаможБрокер</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>BORG</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>POs</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Invoices</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ActivityCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/ИмпортМенеджмент/ИмпортМенеджмент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИмпортМенеджмент</name>
  <resources>
    <name>СуммаНДССтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПошлин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПошлин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбщаяСуммаТаможенныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ГТД</name>
    <comment>Номер ГТД       (Declaration №)¶</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетГААП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Декларации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодLawson</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>BORG</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Invoices</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>POs</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ActivityCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/СписаниеСуммПоДекларациям/ObjectModule.bsl
//Добавил РГ-Софт - Пронин Иван
Перем мУдалятьДвижения;
//Конец добавления

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Добавил РГ-Софт - Пронин Иван
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	КонецЕсли;
	//Конец добавления
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	Если КонецПериода = неопределено тогда
		сообщить("Не указана дата списания!");
		отказ = истина;
		возврат
	КонецЕсли;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		// register ИмпортМенеджмент Расход
		Движение = Движения.ИмпортМенеджмент.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ГТД = ТекСтрокаСостав.ГТД;
		Движение.AU = ТекСтрокаСостав.AU;
		Движение.СчетГААП = ТекСтрокаСостав.СчетГААП;
		Движение.Основание = ТекСтрокаСостав.Основание;
		Движение.ПериодLawson = ТекСтрокаСостав.ПериодВЛоусоне;
		Движение.BORG = ТекСтрокаСостав.BORG;
		Движение.Invoices = ТекСтрокаСостав.Invoices;
		Движение.POs = ТекСтрокаСостав.POs;
		Движение.Валюта = ТекСтрокаСостав.Валюта;
		Движение.Поставщик = ТекСтрокаСостав.Поставщик;
		Движение.СуммаПошлин = ТекСтрокаСостав.СуммаПошлин;
		Движение.ПроцентПошлин = ТекСтрокаСостав.ПроцентПошлин;
		Движение.СуммаНДС = ТекСтрокаСостав.СуммаНДС;
		Движение.ОбщаяСуммаТаможенныхПлатежей = ТекСтрокаСостав.ОбщаяСуммаТаможенныхПлатежей;
		//RG-Soft_IvanovAnton
		Движение.ActivityCode = ТекСтрокаСостав.ActivityCode;
	КонецЦикла;
	// writing register movements
	Движения.ИмпортМенеджмент.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

//Добавил РГ-Софт - Пронин Иван
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	//Добавил РГ-Софт - Пронин Иван
	мУдалятьДвижения = НЕ ЭтоНовый();
	//Конец добавления
КонецПроцедуры
